"[{\"views\": null, \"score\": 7, \"num_comments\": 8, \"created\": 1612598206.0, \"title\": \"If $GME$ hits $150 in a week I will buy every single item on r/ActiveDeals & donate it to my local hospital.\", \"body\": \"I know it's coming, it's tough but it's going to be a rocket week. As soon as the HF have to pay their shorts we are up! I've invested over $20,000 CDN at around $40, so when $150hits again I'm going on a charity spree getting everything on /r/ActiveDeals. I've been down almost my whole life so it's nice to have a win finally, and be able to share it with others in need.\"}, {\"views\": null, \"score\": 6, \"num_comments\": 8, \"created\": 1612598079.0, \"title\": \"First off...holding 500 GME @ $65 \\ud83d\\udc8e\\ud83d\\ude4c\\ud83c\\udffc Second off...why isn\\u2019t there more focus NOK They have a contract with NASA for interstellar communication. GME to \\ud83c\\udf1a NOK to \\ud83c\\udf1d \\ud83d\\ude80\\ud83d\\ude80\", \"body\": \"Google it retards.\"}, {\"views\": null, \"score\": 0, \"num_comments\": 14, \"created\": 1612597184.0, \"title\": \"Alternative communities\", \"body\": \"Hello boiz/girls\\n\\nThe whole gme and the combination of my new job got me back into investing. Now i am looking for active communities that like to discuss the market and give advice etc. \\n\\nAre there any groups/pages/communities you guys can recommend for me?\"}, {\"views\": null, \"score\": 7, \"num_comments\": 19, \"created\": 1612596927.0, \"title\": \"If you hold GME for a loss just claim it as a loss on taxes (even more reason to hold)\", \"body\": \"I bet half you retards didnt know if you dont hold GME for long enough you cant claim the loss from GME on 2021 taxes.\\n\\nAlso fuck you im not a tax professional or financial advisor i'm some fucking moron who willingly threw 300$ for a share of GameStop because I felt like loosing money, thats what we fucking do here, Buy high sell low, and never sell.\\n\\nSo dont be an autist and hold your damn GME stop being a paper handed baby and claim that loss (if the squeeze has indeed sqoze) on your taxes you dumbass\"}, {\"views\": null, \"score\": 10, \"num_comments\": 11, \"created\": 1612596567.0, \"title\": \"BEFORE | DURING | AFTER $GME HYPE using my life savings as a college student \\ud83d\\ude2a (January 17 to February 6) | Still doubled my gains by using both \\ud83d\\udc8e\\ud83d\\udd90 and \\ud83d\\udcc4\\ud83d\\udd90 ...\", \"body\": \"\"}, {\"views\": null, \"score\": 0, \"num_comments\": 14, \"created\": 1612596502.0, \"title\": \"GME sucks, this is the quest for the most downvoted post. post your most downvoteable advice. lets see those DD's that have nothing to do with GME.\", \"body\": \"Fuck GME.\"}, {\"views\": null, \"score\": 17, \"num_comments\": 6, \"created\": 1612596501.0, \"title\": \"Is it too late to post GME gains?\", \"body\": \"\"}, {\"views\": null, \"score\": 30, \"num_comments\": 44, \"created\": 1612596403.0, \"title\": \"WSB has been taken hostage by new mods allowing bots and fake accounts overrun the sub with GME hate #GME\", \"body\": \"The only reason the narrative would change so drastically is because of this. Watch my post get bombarded with extremely hateful, disrespectful, fear mongering comments. The mods have been compromised nobody on this sub can be trusted anymore and all of you should know that now. STAY STRONK GME STONK\\ud83e\\udd8d\\ud83d\\udc8e\\ud83c\\udf4c\\ud83d\\ude80\\ud83d\\udc7e\\ud83d\\udca6\\ud83d\\udcc8\"}, {\"views\": null, \"score\": 4, \"num_comments\": 28, \"created\": 1612596221.0, \"title\": \"Why are posts being removed?\", \"body\": \"All of a sudden I see posts, especially those about GME, being removed which wasn't the case until this couple of days...why?\"}, {\"views\": null, \"score\": 35, \"num_comments\": 24, \"created\": 1612596079.0, \"title\": \"7 million new users joined because of GME. GME Is here to stay for a while like it or not.\", \"body\": \"New users are still signing up.  GME discussions have not caused decrease activity in this forum.  It is fact that it is too early to see where this really is taking off. Fellow apes dont be discouraged by shills and bots claiming we want slv or plutonium, or those who want to push us out.\\nAs for those crying about too much GME posts, how about you leaves the internets for a while and attend your wives.  Im sure their boyfriends need a short break.\"}, {\"views\": null, \"score\": 37, \"num_comments\": 29, \"created\": 1612596027.0, \"title\": \"\\u270b\\ud83c\\udffb\\ud83d\\udc8e GME 500c 2/5\", \"body\": \"\"}, {\"views\": null, \"score\": 7, \"num_comments\": 63, \"created\": 1612595723.0, \"title\": \"Too drunk should I invest 800 thousand dollars on gme\", \"body\": \"\"}, {\"views\": null, \"score\": 0, \"num_comments\": 17, \"created\": 1612595459.0, \"title\": \"\\\"Get your GME shirt and show the world that you're at the front!\\\" Whomst of you motherfuckers did this? :D\", \"body\": \"\"}, {\"views\": null, \"score\": 0, \"num_comments\": 54, \"created\": 1612595448.0, \"title\": \"Can WSB build a wall and deport every $GME pusher?\", \"body\": \"It\\u2019s true, and WSB used to have the best and the finest. When $GME sends its people, they\\u2019re not sending their best. They\\u2019re not sending you. They\\u2019re not sending you. They\\u2019re sending people that have lots of problems, and they\\u2019re bringing those problems with us. They\\u2019re bringing drugs. They\\u2019re bringing crime. They\\u2019re rapists. And some, I assume, are good people\\n\\nBut I speak to WSB and they tell us what we\\u2019re getting. And it only makes common sense. It only makes common sense. They\\u2019re sending us not the right people.\\n\\nIt\\u2019s coming from more than $GME. It\\u2019s coming from $AMC and $BB, and it\\u2019s coming probably\\u2014 probably\\u2014 from $NOK too. But we don\\u2019t know. Because we have no protection and we have no competence, we don\\u2019t know what\\u2019s happening. And it\\u2019s got to stop and it\\u2019s got to stop fast.\"}, {\"views\": null, \"score\": 259, \"num_comments\": 80, \"created\": 1612594336.0, \"title\": \"Google Trends: \\\"Buy a Reddit account\\\" search results have all time high at the same time as GME stock rise\", \"body\": \"\"}, {\"views\": null, \"score\": 0, \"num_comments\": 6, \"created\": 1612594221.0, \"title\": \"GME & The Tale of The Retarded Apes.\", \"body\": \"\"}, {\"views\": null, \"score\": 74, \"num_comments\": 19, \"created\": 1612594197.0, \"title\": \"You're all just spamming/karma whoring now and it's not helping.\", \"body\": \"I hold 200 GME stock and even I find these low quality, desperate, repetitive, shitpost to be cringe, the worst offender being pleads for big names to help. \\n\\nTake your Karma farming to another subreddit, and your desperation is apparent and not helping anyone.\\n\\nIf you're still holding GME, you believe that the hedges are shorted, and will lose money everyday as interest increase. All we have to do is hold and we will win eventually. Your desperate low effort post/karma farming is cringe and does not inspire any confidence. It reeks of weakness and uncertainty. It's also the reason for the \\\"GME\\\" fatigue. Well not shit, anyone would be fatigue looking at so much shit all day.\\n\\nYou know what does inspire confidence? High Quality Meme or DD. So shut up if you don't have either and stop spamming this shit. It's fucking embarrassing. I am just gonna enjoy the show, hold, and wait to see if I am right or wrong weeks/months from now.\\n\\nr/gme\"}, {\"views\": null, \"score\": 63, \"num_comments\": 71, \"created\": 1612594163.0, \"title\": \"Stop with the ape crap.\", \"body\": \"It\\u2019s in your best interest to stop acting like a bunch of dumb sheep who bought GME simply because they were following WSB, DFV, or the crazy FOMO price action. \\n\\nThat stupid ape narrative will only be used to \\u201cprotect you\\u201d with more trading restrictions for the lower classes. Think of the part time day trading rules, which make it harder to make money, but worse. \\n\\nIf you\\u2019re new here, \\u201capes together strong\\u201d was never a thing until the last couple weeks. It showed up with all the new people (bots?). Before then, we called people retards, not as a sign of strength in numbers, but to make fun of people that think they understand the market and get burned. \\n\\nI mean, yeah, it\\u2019s a joke about us being dumb. But along with loss porn, it\\u2019s a reminder to fucking be careful. Anything could happen. Use risk management.\\n\\nThis is a fucking casino. You could be right about some stupid stock going up 5% tomorrow. Or the whole god damned market could crash, and you\\u2019ll just be another loser down 20%, regardless of your amazing DD. \\n\\nWe all know the risks. \\n\\nSo don\\u2019t whine about losing all your money. Don\\u2019t ask for handouts on this sub, because you risked more than you could lose. More than anything, stop acting like ignorance makes you strong. It never did. \\n\\nIt\\u2019s your money. You made grown up decisions. Own your losses. Don\\u2019t let legislation take more freedoms away from us within the \\u201cfree market\\u201d to protect us, the \\u2018poor dumb apes.\\u2019\\n\\nWSB is being scapegoated for this fiasco, even though many of us had good reasons to invest in GME. The thing that wasn\\u2019t accounted for by most people was the sudden restriction on buying for multiple days until all momentum died. The ability for brokers to abruptly make that decision needs to be challenged.\\n\\nSo pull yourself together and do some research about the way brokers created an artificial selling pressure to push the price down. Then, maybe contact your state representatives with something more coherent than diamond hands and ape noises.\\n\\nEdit: typos because it\\u2019s 1am, I\\u2019m tired and retarded.\"}, {\"views\": null, \"score\": 0, \"num_comments\": 74, \"created\": 1612594011.0, \"title\": \"So what about the GameStop business model makes GME a good buy? Or is it simply a meme stock?\", \"body\": \"I mean seriously, GameStop has been slowly becoming the Blockbuster Video of gaming and people are thinking that GME is a longterm investment.\\n\\nThey have been closing down stores left and right.\\n\\nGet at me\"}, {\"views\": null, \"score\": 0, \"num_comments\": 47, \"created\": 1612593877.0, \"title\": \"RH hate is dumb and misguided.\", \"body\": \"Stop crying about RH, your GME movement is crying about RH and touting sticking it to the billionaires, meanwhile RH only folded in that moment because they are a smaller new platform with no where near as much $ - I\\u2019m sure if RH could have afforded to continuing letting retail consumers buy shares they would have - then you all flocked to multi-billion dollar brokers while claiming you hate the 1%\"}, {\"views\": null, \"score\": 12, \"num_comments\": 15, \"created\": 1612593876.0, \"title\": \"\\\"Hold\\\" means \\\"moon\\\" in Hungarian. And my auto correct changes \\\"Hold\\\" to \\\"Gold\\\" frequently. I love GME! Go RC!!\", \"body\": \"DD\"}, {\"views\": null, \"score\": 75, \"num_comments\": 17, \"created\": 1612593859.0, \"title\": \"Stop your shares being borrowed\", \"body\": \"So you have some GME and AMC and you are \\ud83d\\udc8e\\ud83d\\ude4c cos you're a legend.\\n\\nDid you know that Melvin can still borrow your shares for shorting anyway?\\n\\nIf you put a sell price in, eg sell at $10000 then your share has an order on it and this stops Melvin from being able to borrow your shares.\\n\\nSome brokers have blocked this facility, so while they haven't stopped you trading on shares they are handing them to Melvin in the background. So even if you are a \\ud83d\\udc8e\\ud83d\\ude4c legend you are helping Melvin.\\n\\nSet a limit!\\n\\nMy broker, Hargreaves and Lansdown, has removed this facility, but only for meme stock (conveniently). Not sure how this can be legal but we all knew Melvin and co don't play fair.\"}, {\"views\": null, \"score\": 95, \"num_comments\": 45, \"created\": 1612593556.0, \"title\": \"This dip is not real and this isn't really happening\", \"body\": \" I didn't sell at $450+ and I wasn't wrong for making that decision, this is someone's manipulation and they are causing this to happen.\\n\\nPossible candidates for my theory.\\n\\n* Citadel\\n* Melvin\\n* JP Morgan\\n* Jeff Bezos\\n* China\\n* All of them together\\n\\nI have concluded through my fibonachi technics that my portfolio value hasn't gone down at all. The price of GME is actually way above $1k and almost about to hit $6900. We just can't see it yet because someone is trying to steal my/our $GME.\\n\\nYour probably seeing the picture a lot clearer now i've explained it to you, unfortunately my wife still doesn't believe me. She's told me if I don't start showering and remove the hand drawn price charts from the walls of the house, she's going to leave me.\\n\\nAt this point your probably asking if my wife is working with china. This is a big unknown for me, if true the rabbit hole is deeper than I initially expected. But I have plenty more cards up my sleeve.\"}, {\"views\": null, \"score\": 31, \"num_comments\": 16, \"created\": 1612593525.0, \"title\": \"Google Trends: \\\"How to Buy a Reddit Account\\\" had HUGE spike in searches at same time as GME spike! This is big!\", \"body\": \"\"}, {\"views\": null, \"score\": 347, \"num_comments\": 39, \"created\": 1612593506.0, \"title\": \"Notice how silver stopped trending in the news as soon as GME took a dive. You can't make this shit up.\", \"body\": \"\"}, {\"views\": null, \"score\": 0, \"num_comments\": 21, \"created\": 1612593390.0, \"title\": \"When did you get out IF you got out? Escape from GME Snake Plisken style.\", \"body\": \"When Elon First tweeted out etsy I noticed she CRASHED HARD immediately after and I believed that was a warning of sorts that she would go down fast.   Thank God I listened and I bailed THE FUCK OUT the morning after meme good Elon, destroyer of shorts pulled the pin on his short cunt killer pineapple grenade 9000.  Roughly 330 at exit..  Thanks Musk!  And yes, I'm quite proud of my mediocre at best, retarded,  5 inch penis having not even six digit bank account rockin' dumbass not getting greedy and timing things very well for once..... as options are all about proper timing and really nothing else.  Did you make it?  Tell your story here.\"}, {\"views\": null, \"score\": 3, \"num_comments\": 5, \"created\": 1612593267.0, \"title\": \"Hope to Hold for Now and Forever\", \"body\": \"Since many a ape will lose bananas and their own sanity throughout the weekend. I find it useful for any that are giving into negativity by the hands that give hand-jobs with the quality grip of paper, to realise GME is not just a mere speculative bubble anymore but a plausible and prosperous business model with longevity in mind. Here is an extract from a research paper of what to think about while you hold with those diamond hands of yours. If you must get further approval from your wife\\u2019s boyfriend then do so but make your own choices.\\n\\n\\u201cAlthough the years-long short thesis implies a terminal value of zero (bankruptcy), we see this outcome as virtually impossible given the current state of GameStop\\u2019s financials, incoming console revenue, and proven ecommerce results trajectory. In fact, our analysis clearly shows\\n3 distinct paths to profitability:\\n\\n\\u2022 A Bear Case ($32.00) tracking the existing \\u201cGameStop Reboot\\u201d initiative, with successful footprint rationalization to 2,000 stores in North America by 2023, steady ecommerce contribution, and a continued market decline in physical games not offset by major business model updates.\\n\\n\\u2022 A Base Case ($80.00) that is similar, but with a material increase in ecommerce revenue contribution, plus greater impact from digital revenue sharing with vendors, and some participation in other digital-first businesses.\\n\\n\\u2022 A Bull Case ($169.00) based on a full transition by 2025 to the ecommerce- first \\u201ccultural gaming hub\\u201d hinted at by Ryan Cohen, with a significant increase in revenue attributed to ecommerce, new vendor partnerships, meaningful participation in the advertising revenue pool for gaming, and growth acceleration in the overall TAM for gaming.\\u201d\\n\\n\\nSource: https://www.gmedd.com/wp-content/uploads/2021/01/GMEdd-GameStopValuation-20Jan21.pdf\\n\\n\\nI need to confess I sold as the doubt kicked in and the paper hands got to me. So that makes me a paper hand chimp now (forgive me). My hands may have became paper, however I promise I will turn these disgusting so-called hands back into beautiful diamonds by holding till they touch the dark side of the moon to repent for my sin. \\n\\nMandatory Emojis: \\n\\n\\ud83d\\ude4c \\ud83e\\udd8d\\ud83d\\udcc8\\ud83d\\ude80\\ud83c\\udf11\\ud83d\\udcb0\\ud83e\\udd11\\n\\nI do need to say I have lost more money in life than I\\u2019ve made, with very poor life choices resulting in further poor outcomes. As such, I am not and never will be qualified to be a financial advisor and everything I wrote is fictional at best.\"}, {\"views\": null, \"score\": 0, \"num_comments\": 33, \"created\": 1612592848.0, \"title\": \"I don\\u2019t give a shit about your wholesome story regarding your gains\", \"body\": \"It\\u2019s the most cringe shit ever, post it in r/all or r/wholesome cuz that\\u2019s where it belongs. I\\u2019ve literally seen motherfuckers post \\u201cI paid off my chemo with my GME gains\\u201d or \\u201cI finally have enough to buy my first car because of GME\\u201d and \\u201cthanks to GME I can finally pay for my sisters wedding\\u201d.... NOBODY FUCKING CARES!!! I literally guarantee you maybe 1% of pre 2020 WSB users care. This is not a place for you to share you heart warming story about how your life turned around. People here make $200k all the time. And you know what they do. Post a screenshot of their account and that\\u2019s it. Cuz that\\u2019s all it\\u2019s about. Literally take your karma farming bullshit elsewhere you NPC\\u2019s  \\ud83d\\udcc9\\ud83d\\udcc9\\ud83d\\udcc9\"}, {\"views\": null, \"score\": 18, \"num_comments\": 42, \"created\": 1612592580.0, \"title\": \"Why I think something incredibly terrible and mischievous is going on here.\", \"body\": \"Dont feed the trolls. r/GME is just a divide and conquer strategy put forth by the HF pr trolls. They are trying to kill the message. I\\u2019ve never seen financial institutions behave this way. Your concerns about a Powderkeg I believe are well warranted considering the incredibly abnormal behavior we are seeing over a short squeeze, which should be a relatively normal financial event that has occurred many times in the past. But clearly GME is something else.\\n\\nThis is not my comment but it makes complete sense in why the trolls are full force tonight and even the past month. Stay strong brother apes \\ud83e\\udd8d\\ud83d\\udc8e\\ud83d\\udcaa\\ud83d\\ude80\\ud83d\\udc7e\\ud83c\\udf4c\\ud83d\\udcc8\"}, {\"views\": null, \"score\": 8, \"num_comments\": 39, \"created\": 1612592509.0, \"title\": \"Can someone explain to me a few things about AMC stock?\", \"body\": \"For what we know it is not as shorted as GME, correct? If I remember correctly it's only at 70-80% shorted vs GME closer to 120% 2 weeks ago. Is there any way the \\ud83c\\udf08\\ud83d\\udc3b could use the remaining to fill their shorts over time by trading between each other?\\n\\n\\ud83d\\udc4d\\ud83d\\ude4c\\ud83d\\udc8e GME 45 @ $170. All are in my will. Free PS5 or XBox whatever's for all of us.\"}, {\"views\": null, \"score\": 2, \"num_comments\": 12, \"created\": 1612592488.0, \"title\": \"Any space ape \\ud83e\\udd8d \\ud83d\\ude80 podcasts involving $GME I can fall asleep to over the weekend?\", \"body\": \"Help me out.\"}, {\"views\": null, \"score\": 15, \"num_comments\": 113, \"created\": 1612592285.0, \"title\": \"Do I still hold $GME and $AMC????\", \"body\": \"I\\u2019m new to stocks and have just been buying shares based on everybody on social media. I have no clue about any of this. If anybody can refer me to some good ways to learn stocks that would be great\"}, {\"views\": null, \"score\": 0, \"num_comments\": 33, \"created\": 1612592258.0, \"title\": \"What if the big guys start betting more on GME going up than they did it going down and you guy us make them money?\", \"body\": \"\"}, {\"views\": null, \"score\": 0, \"num_comments\": 10, \"created\": 1612592243.0, \"title\": \"The best thing about GME was WSB\", \"body\": \";\\u2019)\\nYeah I\\u2019d pay $300 for you \\n\\ud83d\\ude2d\\n\\nPs noooo ffffff flair is too hard for a noob\"}, {\"views\": null, \"score\": 23, \"num_comments\": 33, \"created\": 1612592226.0, \"title\": \"Can we really trust the February 9th release of info on shorts?\", \"body\": \"I have a very bad feeling that hedges are waiting for this date to show some kind of mis-represented or misleading information on the shorts, and causing the stock to crash further before selling.\\n\\nEveryone here is saying s3 changed their formula, as well as other sites. There's a general consent that [its very possible] hedge funds using dirty tactics to also make it look like they've covered when they couldn't possibly. As there simply wasn't enough volume and upward stock movement to cover. \\n\\nIf they can't manipulate or misrepresent the nasdaq results, then they should be very aware of the high possibility the stock will rebound on Feb 9-10. So unless they cover their positions on Monday (which is VERY last minute) they're going to be paying way way more to cover than it is now. On top of that, I'm expecting the volume / price on Monday to go up, as many people are similarly speculating  possibility of GME making a comeback with the Short news.\\n\\nHowever, if they can manipulate or misrepresent the NASDAQ listings, it would make a lot more sense: as a lot of people are holding onto the stock for the Feb 9 results. If that happens, I imagine they would cover on the 11-12 after the price drops \\n\\nWhat are your thoughts on the matter?\\n\\n**Edit: to clarify I'm very bullish on GME. I'm not trying to spread FUD. I'm trying to explain why it might be a good idea to hold past Feb 9th if the stock crashed. As well as why the short interest might look the way it is**\"}, {\"views\": null, \"score\": 0, \"num_comments\": 9, \"created\": 1612591304.0, \"title\": \"Retards holding multiple hundred shares of $GME\", \"body\": \"I don\\u2019t know how autistic you guys have to be to know this game is up because you guys attracted too much pussies in game and those pussies sold at stop loss. \\n\\nSo go ahead and sell call options for the shares you\\u2019re holding. If GME falls you still get something from selling the options. If it reaches the strike price you still get to sell at strike price. Literally win win situation.\"}, {\"views\": null, \"score\": 0, \"num_comments\": 57, \"created\": 1612591132.0, \"title\": \"Listen up you smooth brained imbeciles. This is where the money is. \\ud83d\\ude80\", \"body\": \"GME is so yesterday. AMC is tanking. BB is the fucking wave. Partnering with Amazon. Google is eyeing them. Motley fool had them in top 3 stocks this week.. blackberry is incredibly undervalued and will continue to rise. Too the fookin moon mates\\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\\ud83e\\udd0c\\ud83c\\udffb\"}, {\"views\": null, \"score\": 46, \"num_comments\": 26, \"created\": 1612590929.0, \"title\": \"Public announcement\", \"body\": \"Ok so there\\u2019s a couple things I would like to say to those that have recently joined this sub thinking it\\u2019s the Alaskan gold rush.\\n1. When you win, please be great full. I know I\\u2019m no og but for those of us that have been here prior to the GME craze understand when to be happy about a win. If you make money you should be happy. No it\\u2019s ands or buts, you have a dollar that you didn\\u2019t have before be grateful for god sake.\\n2. To the losers (not in a negative tone). If you thought the market was going to be easy and just print money for you I am truly sorry to burst your bubble. If things where that easy then everyone would be rich. You may think that you are special so you can win in this game. Well hate to break it to you, you may be special but not special enough to win in this game.\\n3. UNDERSTANDING: be aware that the market has ups and downs. Panic is not the answer. Some days your up some days your down. If you want to succeed in the game you need to be persistent but not naive. Understand when a loss is a loss but don\\u2019t get to trigger happy.\\n4. Everyone has won and everyone has lost don\\u2019t think your special because you just so happened to be on either side. \\n5. LASTY: if you have taken a large loss, remain calm. Everything will be ok! I\\u2019m not telling you to double down but I\\u2019m not saying to quit. You need to evaluate your financial position and make an educated decision on whether or not to continue. If you have lost greatly, sometimes it\\u2019s best to take a break and revaluate at a later time. DONT WORRY YOU WILL BE OK!\\n\\nSynopsis: it\\u2019s a dangerous game. Have fun, be safe and make smart decisions that will benefit you in the long run. Know when to take profits or when to call it quits. Good luck to all!\"}, {\"views\": null, \"score\": 60, \"num_comments\": 188, \"created\": 1612590572.0, \"title\": \"There is now a GME-dedicated sub. Please go there to post about GME!\", \"body\": \"[https://www.reddit.com/r/GME/](https://www.reddit.com/r/GME/)\\n\\nIf you want to post about GME, please go do it on this sub! I used to love the variety of different stocks WSB was doing DD on and investing in but now everything is Gamestop. This is turning people off from the sub, and pushing people to start other subs because only GME posts gain traction. Many people have spent a lot of time and effort to post DD on other investments only to have gotten down voted and/or banned.\\n\\nThis will probably get downvoted to the ground, but it needed to be said. Take it from a pre-GME wallstreetbetter, this sub was a lot more fun when it wasn't dedicated to one stock.\"}, {\"views\": null, \"score\": 31, \"num_comments\": 55, \"created\": 1612590128.0, \"title\": \"Most recent $GME Short Interest data according to S3 Partners puts shorts at an average short of just $53 a share as of 2/5\", \"body\": \"Please bear with me, as this is my first post here after reading a thousand posts over the past month or so.  HODLing 120 shares of $GME, I am not a financial professional, definitely don't buy on my advice alone, do your own DD.  \\n\\nAs we all know, finding accurate short interest data is hard to come by.  By the time the official numbers are released (coming this Tuesday 2/9!) it is too late, as they are for almost 2 weeks prior.  As such, we have to rely on estimates of the data.  One of the companies providing those estimates is S3 Partners.  Many of us here have very mixed opinions about them, and my own is still being decided.  \\n\\nRegardless, if the information they are providing is any way accurate, it gives us a sense of what price the shorts are in at, which is a huge factor at play.  If they had covered earlier, and then shorted the stock at 350 a share?  Bad news for us.  However, it appears this is not the case!  Read on, those of you that can.  Have a banana for those of you who cannot.\\n\\n2 days ago, the twitter face of S3's data, Ihor Dusaniwsky tweeted this:\\n\\n[https://twitter.com/ihors3/status/1357352226507915265](https://twitter.com/ihors3/status/1357352226507915265)\\n\\n\\\" [$GME](https://twitter.com/search?q=%24GME&src=cashtag_click) short interest is $2.39BN; 25.86M shs shorted; 50.68% SI % Float; 33.63% S3 SI % Float; 11% borrow fee and rising. Shs shorted have decreased by -36.2M over the last week. Shorts are down -$8.68BN in 2021, which includes up +$437M on today's -18% move.\\\"\\n\\nNow I'm no expert, but a dollar amount on the short interest, coupled with the number of shares, should give us an estimate of the average dollar amount that shares are being shorted at, right?  If I short 100 shares at $10 apiece, my short interest is $1000, no?  Well, take that $2.39BN and 25.86M shares shorted the other day, and you get $92.42.  Which makes sense, because he goes on to say that they are up $437M on Thursday, as the stock was down 18% at the time and the numbers work out.  \\n\\nLikewise, he tweets again the day tomorrow, 2/5, with similar data, BUT one big difference.  The number of shares shorted is barely changed, however the short interest is only $1.38BN now.  Read:\\n\\n[https://twitter.com/ihors3/status/1357720599699849217](https://twitter.com/ihors3/status/1357720599699849217)\\n\\n\\\" [$GME](https://twitter.com/search?q=%24GME&src=cashtag_click) short interest is $1.36BN; 25.40M shs shorted; 49.77% SI % Float; 33.23% S3 SI % Float; 8.83% borrow fee. Shs shorted have decreased by -32.4M over the last week. Shorts are down -$8.48BN in 2021, which includes down -$368M on today's +27% move to $68.\\\"\\n\\nAnd much like the day before, the numbers add up!  They lost $368M because the stock rose from $54 to what he was seeing at the time, $68ish, and 25.4M shares shorted times $14 apiece is a loss of $368M.  Furthermore, it lines up with the price they are now shorted at, which was $53.54 a share ($1.36B/25.4M shares).  \\n\\n&#x200B;\\n\\nOkay, if you're still with me, and I'm totally off base here, let me know.  I'm actually not a true believer in a short squeeze still happening. However I am a true believer in not allowing hedge funds to short a company to oblivion.  They are neither fraudulent nor in financial difficulties, they have new leadership and a path forward, and while one could argue what the true price of their stock should be, you could say that about half of the speculative stocks that exist in the market today.  \\n\\nAnyway, thanks for reading, looking for additional data that you may provide in the comments below rather than the recent twitch chat spamfest of the past few weeks.\"}, {\"views\": null, \"score\": 129, \"num_comments\": 44, \"created\": 1612589857.0, \"title\": \"Why you should step away for the weekend.\", \"body\": \"If you believe there is still a possibility of a GME squeeze, then nothing you read on reddit will change that. If you read the DD, understood the the squeeze, and the risk that it doesn't work out then remain confident in your bet.\\n\\nBetween bots, FUD and low morale I found it hard not to stay glued to reddit analying what might be going on. Even the search for positive bias felt increasingly futile and stressful. I was considering selling, not even for financial reasons, but for my mental health. But I remind myself I believed in this long shot, I decided to invest in it, and I'm damn well going to see how it plays out. So ive decided to spend this weekend on other things in my life that make me happy and return to gme with a level head monday. The stronger I am emotionally the stronger my diamond hands. \\n\\nOr as my friend said when I began to doubt and panic:\\n\\n\\\"Relax and manifest Versace robe\\\" \\n\\nTldr: manifest versace robe \\ud83e\\udd94\\ud83d\\udd2b\"}, {\"views\": null, \"score\": 0, \"num_comments\": 46, \"created\": 1612589756.0, \"title\": \"Can we get a stickied GME bash thread?\", \"body\": \"Seems there are dozens upon dozens of people posting separate topics bashing GME and complaining about all the posts about it. \\n\\nIronic eh?  \\n\\nSo lets give them one thread where they can put all their complaints in, since they are doing exactly the same as what they are complaining about.\\n\\nSmooth brains be pretty shiny and buffed.\\n\\n\\nP.s:  Fuck all ye 4chan weebs here trolling.  Media has forgotten about ye\\u2026 boohoo :)\"}, {\"views\": null, \"score\": 100, \"num_comments\": 60, \"created\": 1612589621.0, \"title\": \"GME and future of WSB ?\", \"body\": \"Fellow retards,\\n\\nI have a couple points I'd like to discuss. I owned GME and sold it most of them when Robinhood screwed us for good. I made TENDIES which is what mattered and why I have been in the sub. I'm not a paid hedge fund bot or shill but I AGREE that hedge funds would love the current state of this sub in my smooth opinion.\\n\\nI've been following the sub around a year. I was a retard and brained washed by boomer financial advices which didn't make me a lot of TENDIES. I got hooked in during March/April when the stock market crashed and autists made fortunes with puts on SPY and calls on Tesla. I was amazed by beautiful retardness.\\n\\nWSB did something truly amazing. GME was the trade of this quarter century. A dude in basement with DDs and bunch of retards did something crazy. Thousands of retards made thousands of dollars. It has changed lifes for good for many people.\\n\\nHowever, the sub has been fallen victim to its success. Let me be clear, the GME was to make Tendies. Taking out a hedge fund was a bonus not the purpose because we know the game is rigged. It's what it is. Unless you have a trillion dollar, you are not likely to change wall street for retail traders and retards. When GME took off and went viral, truly mentally challenged people of reddit homepage jumped on it and it has been transformed into a \\\"movement\\\". TVs, newspapers show this as little guys take on wall street and Elon Musk and Mark Cuban supported this(positions or ban?talk is cheap) I read bunch of comments and got heartbroken that people got in to make money and destroy hedge funds. Now, GME is the only thing. We have lost Tesla gang,Palantir gang,Palenton gang,theta gang who had provided real DD and were the people who came up with GME along with many other trades. Those people made WSB a place where retards gamble but with some sort of fundamental that can increase you change from 0 to 4.2069% Now we cannot hear them due to noise.\\n\\nNow, the sub is filled with people who just yell \\\"HOLD!!!!!\\\" \\\"BUY MORE\\\" \\\"WHO HOLDS????\\\" \\\"GME WILL GO TO MOON\\\". I hope it does and people who got fucked recover. BUT THIS REDUCES THE SUB INTO A SINGLE TRADE where previously there were chances you can actually hear new retarded things that could make you money. Guess who benefits from this current state? GME Diamond Hands with $1000? or Wall St. who is playing carrot on a stick.\\n\\nA hedge fund made $700M on GME. Citadel who has shady relationships with Robinhood made tons of money as market maker because of insane increase of volume. A lot of hedge funds shorted at $300s and made millions. And we are bombarded with truly stupid posts of \\\"WHO HOLDS GME????$5000 IS NOT A MEME\\\" I'd love hearing DDs like DFVs and explain the game plan but these people are actually retards. They just yell some slogans and getting emotional. Sharing the old finra report won't help US.\\n\\nI wholeheartedly hope that GME holders are right, it goes to $5000 and makes millions. I'd be happy for them but if we narrow to one trade (or BANG), we actually give up millions of TENDIES on other trades. We don't get new info. We don't get new DDs. Please stop spamming and provide actual DD so it can actually bring people back on GME if you are right. This would help you too.\\n\\nWe need to find our next GMEs. That's how you make TENDIES. We need retards who got stuff right like messiah DFV so we can win. Everytime we make a good trade, you actually fight off the rigged system.\\n\\ntl;dr: GME narrows down us to a single trade. We need to restore our DNA and get DDs,reduce noise and hear new things that can make us TENDIES. Otherwise GME can be cancerous to this sub which holds you back to make TENDIES\\n\\nThank you for reading and now fuck off\"}, {\"views\": null, \"score\": 0, \"num_comments\": 12, \"created\": 1612589602.0, \"title\": \"Why not use the power of y\\u2019all Reddit apes and wall streets for good shit?\", \"body\": \"If you can make suing companies like gme and amc spike why not use it to help spike EV stocks and short the top dog rich assholes on their millions on oil and gas stocks\\nRussia\\u2019s ass relies on mining and shit we could push them into e commerce revolution or go as far as you want\"}, {\"views\": null, \"score\": 370, \"num_comments\": 644, \"created\": 1612588964.0, \"title\": \"Take your fucking \\\"Movement\\\" elsewhere.\", \"body\": \"Newbs. We can tell you're newbs because you keep talking about unity and \\\"The Movement\\\". That shit doesn't exist here. We're here to make money, period. Go to r/GME if you are looking for someone to jerk you off about 1 specific ticker all night.\\n\\nAlso, we don't give a fuck about your $50 Yolo or your account transferring or any of this other total bullshit that is taking up the subreddit post history. Literally, we do not give a fuck. If you keep it up we will continue to troll you and tell you how fucking stupid you are.\\n\\nStop posting fucking irrelevant shit, read the rules, and use the right fucking flair. Goddamn, it's not that hard. This isn't a pump and dump movement and nobody here has \\\"getting started\\\" advice for you. Go to r/stocks and r/investing if you want someone to answer with any level of seriousness.\\n\\nYou Q-Anon Ape Conspiracy fucks are in the wrong place and you don't belong here. We will continue to berate you until you cry or get banned.\\n\\nEdit to add: I keep getting accused of being paid for this. If some of y'all wanna pay me, DM me and lets arrange something LMAO. to you fucks saying I'm fake. here is a post that references me and my DD posts.\\n\\n[All you \\ud83c\\udf08\\ud83d\\udc3b's who are scared of WSB getting shutdown... I have some DD for you. Follow these people. Last, hold and buy GME! \\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80 : wallstreetbets (reddit.com)](https://www.reddit.com/r/wallstreetbets/comments/l2uakx/all_you_s_who_are_scared_of_wsb_getting_shutdown/)\\n\\nEdit 2: Read the room dumbasses. We will cut your cancer out of the subreddit before the weekend is over. Go shill somewhere else.\\n\\nEdit 3: The anger and rage comes from the following: The pump and dump shit and misinformation has to go. for those of you interested in tendies. There are quality DD pieces and info that will make you money. I lurked for years. I want my quality content back so I can fuck some of you over for money. This shit hopefully ends this weekend and lets get the sub back to it's true purpose.\\n\\nThis isn't financial advice and is purely an opinion\"}, {\"views\": null, \"score\": 0, \"num_comments\": 42, \"created\": 1612588929.0, \"title\": \"GME holders got skunked \\ud83e\\udda8\\ud83e\\udda8\\ud83e\\udda8\", \"body\": \"Let's level here. We all fell in love with the idea of retail investors sticking it to greedy hedge funds. GME value was hyped into an undisputed bubble, because people wanted to see the narrative come true. I see people with diamond hands calling to hold despite losing over 80%, but let's be honest, holding doesn't make stock prices go up. You need buyers for it to go up. And people are out of money. The smart players bought low and sold high.\\n\\nYou can tell me to fuck off and that you'll laugh at me when GME rebounds, but I feel sorry for the people who bought at $300+ and got hella skunked.\"}, {\"views\": null, \"score\": 328, \"num_comments\": 105, \"created\": 1612587504.0, \"title\": \"The state of $GME and WSB\", \"body\": \"First of all, I am not a financial advisor, but a retard with a few shares, don\\u2019t listen to me. \\n\\nI have seen a lot of mixed emotions about the state of the stock right now. Some true autists are still holding on to hope of the MOASS, while others are adamant that it has sqozen. Wherever you stand on this stock, if you have been here for more than a month, you cannot deny that there has been a massive shift in WSB. Granted, bots can be thanked for some of this, but there are a lot of new users who think this is a place for P&D schemes or \\u201cfighting the system\\u201d. At its core, WSB is a collection of retards who sometimes hit the green button at the right time and make \\u201ccRaZy gAiNz\\u201d, but mostly just post about the money they lost on an insane YOLO. WSB is NOT here to tell you the \\u201cnext miracle stock\\u201d. \\n\\nI am all for growing the community, but I can\\u2019t say I am a fan of what the sub is becoming. Thank you to the mods who care about keeping the community and aren\\u2019t just in it for money. \\n\\nedit for retards: FUCK SHORTY, FUCK THE SEC, and HOLD (if u like the stock) \\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\"}, {\"views\": null, \"score\": 13, \"num_comments\": 119, \"created\": 1612586670.0, \"title\": \"What if we are underestimating the size of the GME powder keg?\", \"body\": \"Purely speculation but given how absolutely excessive the hedge funds, DTCC, and brokers have tried to keep GME from squeezing, I'm wondering if we've completely underestimated the damage a real GME squeeze might do?\\n\\nDo we actually know what the real OTC short interest is at and can we trust the reported number? What if it's 10x or 100x higher, we'd have no idea. If the short squeeze actually happened, which is a theoretical infinite squeeze, drive the GME price so some ridiculous million dollar mark, even if briefly?\\n\\nMelvin will go bankrupt, sure, but they're a pretty small fish, it seems excessive to do all this manipulation to save a fledging hedge fund unless the brokers, DTCC, maybe even the entire market is under threat, causing the coordinates attacks we're seeing in an effort to diffuse this.\\n\\nWe also haven't heard a peep from anything from inside these organizations or hedges, it feels like a strict gag order is in effect and the one insider post (if you believe it) seems to paint a picture of an absolute panic inside the financial system, which again seems excessive if only a few smaller hedges like Melvin are being taken down.\"}, {\"views\": null, \"score\": 11, \"num_comments\": 74, \"created\": 1612585893.0, \"title\": \"Real talk abou my GME\", \"body\": \"I\\u2019m pretty much over the hype. Lost two grand and I can see a lot of people lost more. Do you really think that this is a thing or are you all just trying to hype yourselves up every five minutes to keep yourselves from just fucking killing yourselves? \\n\\nLike everyone keeps saying it\\u2019s ladder attacks and shit but come on. We all know everyone is selling like wtf are you talking about. Super tight but it\\u2019s my own fault and again I know people lost a lot worse than me. \\n\\nBut honestly who has any proof this shit ain\\u2019t already dead and done\"}, {\"views\": null, \"score\": 9, \"num_comments\": 22, \"created\": 1612585814.0, \"title\": \"GME Fatigue\", \"body\": \"Look, I like GME just as much as the next guy\\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\\ud83e\\udd8d\\ud83e\\udd8d\\ud83e\\udd8d\\ud83d\\udc8e\\u270a etc. I\\u2019m still holding and buying dips but the ONLY thing I see is GME posts. Is this just me or do multiple people feel the same way.\"}, {\"views\": null, \"score\": 0, \"num_comments\": 13, \"created\": 1612584837.0, \"title\": \"GME short percentage question\", \"body\": \"I know the short percentage is supposed to come out next Tuesday the 9th. Is anybody able to tell me at what time during the day or the best place to see this information?\"}, {\"views\": null, \"score\": 3, \"num_comments\": 50, \"created\": 1612584827.0, \"title\": \"What do y'all think the GME stock will end up looking like after the dust settles?\", \"body\": \"Do you guys think that the stock will rise before falling again? Or rise and stay at a high price? Or crash?? \\n\\nI really want to see people's predictions :)\"}, {\"views\": null, \"score\": 37, \"num_comments\": 65, \"created\": 1612584772.0, \"title\": \"IS EVERYONE HERE LITERALLY A RETARD?? HOW CAN YOU GUYS NOT SEE THE OPPORTUNITY PRESENTED TO US??\", \"body\": \"I don\\u2019t know if i\\u2019m missing something, but I really think people have allowed the novel opportunities of this unique situation to go completely unnoticed thus far. \\n\\nFirst, I\\u2019m going to make a big assumptions that I think is reasonable, and while it may not be what some people want to hear, I will aslo explain why i believe it is also nothing to fear (Lol that rhymed). \\n\\nThe squeeze has been squoze. I\\u2019m sorry to say it, but a 1600% in less than almost 3 months is unprecedented. The price rose because the shorts covered. It\\u2019s really that simple. It perhaps could have gone higher but as we all know ridiculous margins were used to halt buying from brokers, and the momentum was killed - which allowed them to use naked shorts to lower the price so that they could cover at a smaller loss and also limit what retail investors could gain. \\n\\nBUT-  this isn\\u2019t all doom and gloom. Even if they covered on the short positions the interest ratio isn\\u2019t magically 0, and the short interest percentage isn\\u2019t suddenly 0%. These institutions probably saw the peak of $480 and from there on instantly started shorting again for those easy dollars (bearing in mind not one single institution shorted $GME 140% alone, and not every single institution has placed a short position in unity). No one has seen a squeeze happen twice in succession in history before right? A safe bet. Or is it?  \\n\\nFor one, I think it\\u2019s fairly obvious that certain institutions have been selling naked shorts (OTHERWISE CALLED *\\u2019STRATEGIC FAILURES TO DELIVER\\u2019*) throughout this process for damage control purposes - but I truly believe all it has done is reset the timer on an even larger and scarier time bomb. Naked shorting is definitely an illegal activity, but unfortunately it was grandfathered by the SEC, which has allowed it to remain a popular strategy for institutions to use to lower the prices of stocks that they are short against.\\n\\nIf this is true (which I honestly think is most likely), this means that more shorts we\\u2019re created in the process of covering these short positions. Think about it. A ~140% short interest percentage is unprecedented. Insane margins that prevent buying due to 0 liquidity are extremely rare. \\n\\nTHERE WOULDN\\u2019T HAVE BEEN THAT MANY SHARES AVAILABLE TO *TRULY* COVER ANYWAY. \\n\\nThat\\u2019s a STEEEP crash from $480. Do you really think everyone simultaneously chose to sell at $480 once buying was prevented? There are a LOT of what you guys call \\u2018bag holders\\u2019 (I say \\ud83d\\udc8e\\ud83d\\ude4f) which is pretty evident from the state of a lot of subs. I think the hype was real and a lot of people held - not to mention that people were also actively buying large amounts of stock throughout the run-up to the peak, increasing the amount of people trying to get their hands on these shares that were needed to cover, and thus causing the artificial amount of shares in circulation to increase. \\n\\nIn essence, how many I-O-Us were generated in the process of covering would have drastically increased due to the buying pressure leading up to the moment brokers were prevented from allowing RIs to purchase more stocks. Remember: the amount of stocks they needed to short was LARGER than the amount of outstanding shares by 44% so they could have only immediately covered just over 2/3 of what they needed to cover without creating more I-O-Us in the process (granted people weren\\u2019t paper-handing in large enough quantities just quite yet).  \\n\\nThis is what I think is the true reason as to why buying had to be halted from their perspective. Before buying was halted EVERYONE was in solidarity with holding, so the price drops we see during these periods where buying was prevented must have come from these aforementioned naked shorts - to give those paperhands the nudge they needed to sell, so that they could eventually cover their positions without creating more of those FTDs. THIS is the stage that we are currently at right now. \\n\\nEVERYONE CURRENTLY HOLDING THE BAG MEANS THAT IT DOESN\\u2019T MATTER WHETHER THEY COVER OR NOT.\\n\\nEverytime an FTD occurs, someone\\u2019s stock goes missing. Essentially, someone that decides to purchase one of these stocks (or someone that already owns the stock) now has to receive an I-O-U instead of the stock itself. This creates artificial supply. Essentially, there are more positions open than there are stocks available to cover, so even when they have covered their shares, they still need to buy more. Their demand for shares hasn\\u2019t decreased until they can close literally all of their short positions because if they want to cover all of them they have to create more FTDs, since the shares they need to buy don\\u2019t exist.\\n\\nThis is the gist that I\\u2019m getting at. Holding during this stage is paramount, but buying even more so. The more buying that happens during this stage, the more I-O-Us that need to be created by brokers, since they themselves can never get the opportunity to get their hands on shares that haven\\u2019t been artifically created to meet the supply of the crazy demand that they imposed on themselves.\\n\\nThe more I-O-Us they create, the debt of shares they eventually have to buy back to cover increases. Its pretty much directly correlated to the short interest. It also increases how much it costs to short the stock, and thus how much the insitutions bleed before they\\u2019re eventually forced to cover their positions. \\n\\nFrom these assumptions and speculation, it is clear to me that any short holders have set themselves up to be squeezed over and over again so long as they continue to short the stock whilst FTD\\u2019s remain to occur and retards are willing to buy. It\\u2019s like a perfect counter to absurd shorting. \\n\\nIf this theory holds true, to completely simplify it: as long as [Percentage of shares held] + [Percentage of shares shorted] = >100% for long enough + additional buy pressure = SUPER DEMAND for stocks as every new buyer creates a new I-O-U that needs to be covered for later. \\n\\nIll sinplify it even more for you: \\n\\nMore hold, more buy at dip, \\n\\nFurthermore, I think it\\u2019s fairly reasonable to suggest that other institutions recognised that the shorts were covering and also wanted to short that ~$480 price tag, so the short interest might not be too far off what It once was come the 9th Feb. \\n\\nNow that I even think about it, as long as there are large amounts of FTDs with simulatenous large amounts of buying, I don\\u2019t see why we even require a large amount of short interest. If we keep generating I-O-Us then the cost of the short positions increases, which again increases demand for stock, and thus increases the price further. Essentially, you can make them cover by forcing them to spend an absurd amount of money trying to generate the counterfeit stock they require to plug the whole thing (the so called \\u2018strategic fails to deliver\\u2019).\\n\\nIn other words: Our high volume of buying during periods of high FTD occurence causes liquidty to run out for brokers. This forces shorts pay higher interest. This puts pressure on covering. This drives demand and increases the price. This gets you tendies. \\n\\nThis is literally how they get away with driving a stock to bankruptcy and no one notices where all of the counterfeited shares went - they just do the opposite. If they can manage to drop the price low enough, the I-O-Us are cheap enough to where they can pay for all the shares that they owe and discard them - because its nothing in light of the fact that they made a healthy sum off of shorting the stock in the first place. But we can be the driving force that flips this process on its head. We can use their \\u2018strategic\\u2019 failures to deliver against them. \\n\\nI\\u2019m sorry if there are some things that don\\u2019t hold up to scrutiny but this all makes perfect sense from my limited understanding.\\n\\nI just think that this has been a unique moment in financial history. We find ourselves in different circumstances than the past, and we are now able to achieve greater things if we are organized. \\n\\nAlso, i\\u2019m really sorry. I\\u2019m on mobile, and I was not expecting to make this post this long. I look forward to hearing how viable people think this theory is. \\n\\nA Measly 2.2 of $GME @ avg \\u00a3130. \\n\\nTHIS IS NOT FINANCIAL ADVICE. I LIKE THE STONK.\"}, {\"views\": null, \"score\": 4, \"num_comments\": 31, \"created\": 1612584553.0, \"title\": \"Numbers don't lie. If you look at who made money then you need to consider that this whole GME thing was probably engineered by hedge funds (Citadel & SAC) to suck in retail. Retail short squeezing a hedge fund was the only narrative that could have allowed them to sell GME for $300.\", \"body\": \"Citadel has access to Robinhood's order flow, their whole business model is to front run you, so what are the chances that a short squeeze flies under their radar? After the \\\"squeeze\\\" Melvin received fresh capital, they never got squeezed. WSB lost money. This was probably a set up by SAC & Citadel to squeeze retail with GME. While everyone here was going all in hoping to stick it to Wall street someone else was unloading worthless GME shares for $300. Then they continued from $300 down to $50 while WSB was being advised to hold with diamond hands or to buy more, adding even more liquidity for whoever was exiting.\\n\\nIn the end you guys became famous and lost money, while hedge funds made money but were *humiliated*.\\n\\nEdit: Till this morning accounts with less than 1500 couldn't comment, now they can suddenly comment again since I posted this and another post about extreme silver positioning. **This subreddit is captured by hedge funds, the SEC needs to investigate admins and all reddit logs about the activity here. These guys engineered a PnD (gme) and hid it in plain sight by making it look like retail short squeezed a hedge fund.** SEC are you watching???!\\n\\nEdit 2: grammar\"}, {\"views\": null, \"score\": 365, \"num_comments\": 19, \"created\": 1612584521.0, \"title\": \"\\\"One More Time\\\" - An Ode to GME\", \"body\": \"\"}, {\"views\": null, \"score\": 32, \"num_comments\": 42, \"created\": 1612584331.0, \"title\": \"BB Stock\", \"body\": \"As I sit patiently on my GME and AMC stock I have been looking at a few others and the one I am probably most interested in is BlackBerry. I am, however, on the fence. Can anyone here give me their reasons or justifications why they think it is a good stock to invest in? Maybe your reasons will tip me into it.\"}, {\"views\": null, \"score\": 25, \"num_comments\": 35, \"created\": 1612583943.0, \"title\": \"I know you guys don't give real advice but beware of RH...\", \"body\": \"This can't be legal...RH deactivated my account 5 days ago, then put my entire portfolio on margin immediately even though there was cash covering over 80%. Well for days I've emailed and requested access they don't respond. The issue was somehow they fd a deposit and cause it to be blocked. On the first day after they deactivated they put me in a margin call(of course). So my $5000 portfolio only had $4000 to cover investments. I attempted to deposit cash countless times to cover the $1000. Well today they sold all GME and AMC assets(even though I have 2 others that weren't sitting @80% loss that could have been sold to more than cover) so now I have no GME and lost most AMC @ +80% loss. Then what do you know the option to reactive was given literally in the window where the Margin call appeared IMMEDIATELY after the margin call. \\n\\nTL DR: \\nRH fucked up a bank transfer\\n\\nRH then deactivated and put cash backed shares on margin(with no ability to reactivate)\\n\\nRH then did a margin call\\n\\nRH sold +80% losses\\n\\nRH immediately gave option to reactivate after sell.\\n\\n\\nRH is actually a fucking scam. They play so fucking dirty.\\n\\nEdit: because I think you guys are missing my point. THEY DEACTIVATED THE ACCOUNT AND WOULD NOT ALLOW ME TO COVER UNTIL IMMEDIATELY AFTER SELLING. I EMAILED AND REQUESTED ACCESS MULTIPLE TIMES PER DAY EVERYDAY. I'm still deactivated 6 days from initial deactivation with emails from them on day 1 saying they would respond I'm 1-3 business days with NO FUCKING RESPONSE.\"}, {\"views\": null, \"score\": 3, \"num_comments\": 28, \"created\": 1612583777.0, \"title\": \"Change of dialect. Will wsb speak with a new tongue?\", \"body\": \"This really is a humorous place. I just read how some one complained that we don\\u2019t call our selves retarted now instead we are apes strong. \\n\\nI have a problem with this.\\n\\n Before I ever joined wsb I had dumped thousands in penny stocks for 300% gain but would have been happy taking 10% instead of -70%. \\n\\nThen I started buying FD\\u2019s before knowing what they were. You know $20 calls for GE and Ford . Don\\u2019t get me started with tsla weeklies especially before the split. You know when you could think of getting rich buying a $2000 call option when tsla was $9-1200\\n\\nAnyways I said to my self that I was dumb as shit and it was clear when it came to the market I was \\u201cretarted\\u201d \\n\\nI don\\u2019t think it really echoed to my personal life that it was that stupid but it was great reflection of self. Maybe the way I trade stocks is really the reason I\\u2019m fucked up in life. \\n\\nIdk but I would still continue to buy fd\\u2019s the following Monday. And if I lost which of course I did I could come here and laugh with the community. Be happy someone else was a worst trader then me or just more naive. \\n\\nThis is a great group with a certain type of risk takers that is unlike any thing I\\u2019ve ever seen. And yes majority of these risk are on fd\\u2019s that will never print but the beauty is when we count up potential profits. In our minds we have came up with the recipe for success. Unfortunately we just picked the wrong expy and striker. Who would of thought.\\n\\nYet we can spit more game on premium then the herd mentality who\\u2019ve never even had nuts to invest or trade rather, investing is easy (Hence the 401k)\\n\\nIn close I hope the language of this place stays the same. I don\\u2019t want to go to another wallstreetbets make up. That would be weird. It would be equally weird to watch this place change how we discuss topics.\\n\\nI\\u2019ve been here for almost a year. I don\\u2019t know if it\\u2019s just the way you speak when your on Reddit but this sub has a certain way you speak where it just clicks with a certain side of your mental. Either it\\u2019s your or not and you get it or not. Only a certain type of people can laugh at smooth brain jokes and relate. \\n\\nWhat do you think? If we stop calling our selves retards and we view are losses in a more politically correct way will we stop trying to hit it big. Since the conservative approach is 10-15% a year?\\n\\nEdit** I may have worded something wrong. I like being a retard I know that I will be smarter one day and make better decisions. Right now I\\u2019m still trying to figure out why my gme calls for March 5 300 and 350 will make or not\"}, {\"views\": null, \"score\": 37, \"num_comments\": 41, \"created\": 1612583712.0, \"title\": \"The Karma farming has gotten out of hand\", \"body\": \"People need to move to GME specific subreddit there are too many posts with misinformation, \\\"who still holding LOLZ\\\" karma farming, and trying to manipulate markets for quick cash it a mess \\n\\nThe squeeze migth be done i dont really care anymore this sub was never about any specific stock people need to move on please ban all accs younger that 2 months.\"}, {\"views\": null, \"score\": 3, \"num_comments\": 27, \"created\": 1612583676.0, \"title\": \"sold my GME...\", \"body\": \"AND BOUGHT IT BACK AT A $13 PROFIT PER SHARE! **\\ud83d\\udc8e\\ud83d\\ude4c** GME TO THE MOON **\\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80**!!\"}, {\"views\": null, \"score\": 0, \"num_comments\": 12, \"created\": 1612583586.0, \"title\": \"I had some monies now I\\u2019m just have these gme\\u2019s I\\u2019m hang on to them to do more stock with them on another time\", \"body\": \"\"}, {\"views\": null, \"score\": 664, \"num_comments\": 514, \"created\": 1612583035.0, \"title\": \"You people need to understand that you are not waging a war on hedge funds.\", \"body\": \"This isn\\u2019t some ideological battleground. This is the stock market. There are hedge funds taking long positions, there are hedge funds going short *and hedging their bets with long positions*.\\n\\nYou\\u2019re not \\u201csticking it to the man\\u201d holding GME. \\n\\nTrade based on what makes you money. Not ideology. Who gives a fuck. We don\\u2019t celebrate losses here to prove a point, we celebrate the stupid risky plays that the person took regardless of the fact it blew up in their face. \\n\\nIf you think you\\u2019re going to profit off holding, hold. Stop letting people hype you up and manipulate you by framing this as some act of defiance against a corrupt system. You\\u2019re being played.\"}, {\"views\": null, \"score\": 21, \"num_comments\": 9, \"created\": 1612582776.0, \"title\": \"Just found a GME power up newsletter in my email and holy fuck I\\u2019m impressed with their trade ins\", \"body\": \"\"}, {\"views\": null, \"score\": 9, \"num_comments\": 9, \"created\": 1612582151.0, \"title\": \"Are share certificates still a thing? $GME TO MY WALL\", \"body\": \"I want a printed GME share to frame and mount on my wall to prove I was here. I held. Forever.\"}, {\"views\": null, \"score\": 10, \"num_comments\": 51, \"created\": 1612581682.0, \"title\": \"Retards, I have a serious question....\", \"body\": \"Day by day I watch as we dump more money into GME and in the morning we climb that ladder, and as the day progresses that ladder falls over due to these so called ladder attacks that end at the end of the day. Now I am by no means a stock market expert or a financial advisor, but my serious question is, what if someone were to build the ladder at the end of the day?Not a financial expert, just a monkey trying to learn how to use a ladder.\"}, {\"views\": null, \"score\": 0, \"num_comments\": 8, \"created\": 1612581654.0, \"title\": \"Help a fellow Ape\", \"body\": \"I wish to return to monke. What should I use to buy some of this GME?\"}, {\"views\": null, \"score\": 260, \"num_comments\": 80, \"created\": 1612581636.0, \"title\": \"Why GME is still getting catapulted to Alpha Centauri \\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\", \"body\": \"Alright retards, I can barely read and I know the literacy rate of Zimbabwe is better than the literacy rate on this sub so I'll try to keep it simple. I truly believe GME is going to alpha fucking centauri and you should too for the following reasons \\ud83d\\ude80\\ud83d\\ude80\\n\\n1. DFV is still holding. Need I say more? Unlike most of the retards on here with a college degree who can barely use it (including myself), DFV actually has credentials and studied this play to the T. How do I know? Go look at his history post. When we were pissing and laughing at the dude, he was compiling the thesis that would go down in WSB and stock history. Im a retard who trusts a geologist about rocks, why would I doubt DFV about GME? Hell, Id trust a dude with a cat infatuation over Cramer any day of the fucking week.\\n2. The shills. It's clear as day that our beloved republic is infiltrated by bots. These hedgies are unleashing their filth. How do you collapse an enemy? You weaken it from within. All this shit being flung from bot accounts is psychological warfare to incite paper hands. Why? They want you to sell at a loss or a measly profit so the hedgies dont get fucked nearly as hard. If the Squeeze did Squoze and the worse for the hedgies was over, why would they keep getting their bots to spread bullshit?\\n3. Papa Cohen. You read that right. Papa Cohen followed RoaringKitty on Twitter and unfollowed. I dont blame Papa Cohen for doing such. RC doesnt follow that much people on twitter to start with and doesnt want the hedgies crying market manipulation (ironic as that is). This is the same RC that tweeted a roller coaster and had to have it taken down cause his lawyers were strict. Fuck, I bet Papa Cohen is plotting to blow out the shorts as we speak and cant contain his excitement. RC following DFV briefly acknowledges that RC lurks on here. He's like a kid the night before Christmas whose over the fucking moon but cant open his presents, lest his parents give him shit.\\n4. Need rockets \\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\\n5. Market manipulation. Last week, it took GROSS market manipulation in BROAD daylight to stall the rocket to Valhalla. Vlad proved he's a crony and a stooge to hedgefunds. RH will pay because of it. They already have. All this did was STALL how bad the hedgies will get fucked. It didnt stop it. Those fucks are just on borrowed time.\\n6. Ever since the peanut prophecy from our beloved Papa Cohen, he's been dead silent. He had nothing to do with the rally from 40-450$. A short squeeze to squoze needs a catalyst, we almost had it ignited last week but it took a corrupt fucking market to tank it. WAIT for the catalyst, we dont know who or what itll be but we just know itll eventually happen. Papa Cohen is the Messiah about to annihilate the anti-christ, were his trusted army of retards. He'll never let us down just as we swore loyalty to him and his mission to Alpha Centauri \\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\\n7. Fuck the hedgies. I have no problem holding my shares, taking them to the grave, and letting my great-great grandchildren inherit them. For all I know, maybe theyll be worth millions by then. Ill take my chances with GME to beat inflation for the sake of my future offspring. Cohen turned CHEWY into a success, I have no doubt he'll do the same with GME regardless\\n8. All these dirty tactics were made to get you to SELL. RH and other brokers banned buying and didnt allow selling. Did you wonder why that is? If the hedges were covering as that was happening, why did the price keep dropping if the hedgies were buying to cover?  Anybody who sells at this point for a loss or a measly profit is more primitive than a retard\\n9. Its not that hard to hold shares and do nothing. Imagine youre the boomer who bought apple in the 80s and forgot about it. Lo and Hold youre the boomer who couldve been sitting on a gold mine and never acknowledged it till years after.\\n\\nTLDR: HOLD TILL ALPHA CENTAURI. I HAVE NO PROBLEM TAKING MY SHARES TO THE GRAVE AND NEITHER SHOULD YOU  \\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\"}, {\"views\": null, \"score\": 14, \"num_comments\": 40, \"created\": 1612581176.0, \"title\": \"I'm holding because it is simply the most rational thing to do. I'll explain why:\", \"body\": \"SO these short people are basically fucking gamestop, the store where we went to the midnight release for call of duty ghosts are 12am when we were in 6th grade, and doing some shit that is obviously bad and crazy and these people on reddit wsb said fuck that -we like the stock and DFV came in like an eagal -just woah.\\n\\nanyway,\\n\\nthat got fucked and then people said fuck that and bought gme  and were like saying fuck the hedges and shit.\\n\\nAnd this sub, blah blah blah, but informed me that the hedges were doing all this propaganda shit against the reddit and that makes me like, damn, they're scared ass mfs rn running shit, shutting down GME trading and they're sending bots here and ew. it's just so gross and yucky and makes me ant to buy GME and AMC. To be honest, I bought 2 2.5 AMC calls for feb 19 and an 15 and had no idea that they'd blow up, I've really been only following GME news but I condone both, as financial advice. THATS WHAT IT IS. Who cares. Can your uncle give you stock advice and not get fucked? I'm your uncle. Chill. I 'd say to buy GME and hold it because they're scared as hell of the price going up and we CAN do that... lol. It's obvious that the people (DFV) did their proper DD that helped all of us (let's be real, don't we just look for people that say they do DD and say that we do DD by looking at that? lol).\\n\\nSo now we keep doing this thing that makes those guys scared as hell because that means them losing money, which means the people (us\\\\_) getting it, which means let's take this opportunity to do it, idrc they do it all the time. Plus no matter what they'll live. Like they can eat. Not 100% of people in GME can. Maybe like 99%. but still for that 1% let's fuck that hedge %.\\n\\nAnd I'm ready for this to be a crazy moment for a ton of people and it's gonna be really really weird. I'm kinda a fortune teller and I can see images of walking in the store and talking to someone about GME and it turned out well. Just my ADVICE. Dude if you're taking my advice it is = to taking some random guy's advice. No way can you use a random guy giving you advice as some lawer shit idek.\"}, {\"views\": null, \"score\": 9, \"num_comments\": 22, \"created\": 1612581114.0, \"title\": \"Question about the Pressure on DFV\", \"body\": \"Hey all, first time posting here, but I was just thinking about holding and the impact that each of us has. Obviously, some more than others just due to when they started and how much they have. While we don't know if/when we will ever take off, if it is within the litigation period does that screw DFV completely? \\n\\nAs in could they freeze his account or some other stupid means of controlling him? I don't know that is bad, per se, as it forces him to \\ud83d\\udc8e\\u270b. Or on the other end of the spectrum could they force him to sell his shares? \\n\\nI doubt the ladder is possible and the former is more in the ways of the law. But I was just curious. Any thoughts?\\n\\nPositions: GME 1@250, 2@340, 2@200, 8@150\\nAMC 11 @ 9.14\"}, {\"views\": null, \"score\": 0, \"num_comments\": 45, \"created\": 1612581106.0, \"title\": \"Please Explain The Hold\", \"body\": \"I\\u2019ve been in the shadows of this since the beginning, but also have some GME. What is the point of holding GME. I know so many of you are about to erupt on me, but, be nice.\"}, {\"views\": null, \"score\": 23, \"num_comments\": 15, \"created\": 1612580977.0, \"title\": \"Fellow GME shareholders\", \"body\": \"When is the next meeting? And do they usually serve snacks at those? Trying to become more hands on with my investments and see in person how they are performing. Bought 1 share @450.\"}, {\"views\": null, \"score\": 76, \"num_comments\": 18, \"created\": 1612580754.0, \"title\": \"An absolute must read on GME \\ud83d\\udc8e\\ud83e\\udd32\\ud83d\\udc8e\\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\", \"body\": \"The trick would be: \\u201cMake it look like we\\u2019ve covered our shorts when we really haven\\u2019t (because we can\\u2019t), so that short interest falls and the Reddit army gets demoralized, thus breaking the squeeze.\\u201d\\n\\n[Full write up ](https://tradesmithdaily.com/investing-strategies/the-drop-in-gamestop-short-interest-could-be-real-or-deceptive-market-manipulation/)\"}, {\"views\": null, \"score\": 42, \"num_comments\": 30, \"created\": 1612580563.0, \"title\": \"Why do people think WSB can't move a stock like GME?\", \"body\": \"I have seen people saying shit like \\\"*WSB didn't move GME it was really the whales!!*\\\"\\n\\nLets do some basic math\\n\\nWe have 8.6 million members, let's not talk about all the lurkers. On average we can assume everyone has about $500.(On the low end imo) \\n\\nThat's 4.3 billion in potential purchasing power. \\n\\nWhat's GME market cap? 4.5 billion\\nAm I missing something?\\n\\nFor all the OG WSB people, what's the whole reason we got into GME? Has anything changed???\"}, {\"views\": null, \"score\": 10, \"num_comments\": 11, \"created\": 1612580233.0, \"title\": \"Thank you wallstreetbets. And 1 advice/conclusion\", \"body\": \"I just want to thank wsb for the gains i had.. And i want to say what i learned:  \\n  \\nNever tell someone you know irl about your investments. If you loose money, people are assholes. \\\"I told you blabla\\\". If you make gains, people are also assholes. They are envy because you made it and they dont. Either way, ive learned, just keep it for yourself whatever you do.  \\n  \\nI told 1 person, he should buy gme (monday 2 weeks ago). We both bought at 95.00. He sold to early. Then he bought again at 300. Also he told like 5 persons they should buy the stock to. All of them lost, while i made a life changing gain.  \\n  \\nNow they all hate me. They are to dumb to make their own dd or they have no balls or whatever. But they blame me now. \\n  \\nMy conclusion is: i will never tell someone again something about stocks. I am a suit guy, i sell life insurances for a living since many years. A negative feedback from a costumer is rare for me, very rare. But when people loose money on a stock, they will blame you for it. They will blame you and it will never be the same again with those people.  \\n  \\nI love you all for beeing retarded autist apes. Thank you for changing my life in a positive way. Im still holding 250 shares of gme btw.  \\n  \\nI also think/feel the real short squeeze will come in the near future. I somehow know and feel the whole thing is not over yet.  \\n  \\nLast: thank you swissquote (swiss broker) that you, different as robinhood et al, did not manipulate buy orders of any stock, ever.\"}, {\"views\": null, \"score\": 3, \"num_comments\": 16, \"created\": 1612579957.0, \"title\": \"I LOVE HOLDING GME\", \"body\": \"I love holding GME and I am so excited to hear future news from Ryan Cohen! ESPECIALLY knowing these MM's will have to buy a FUCK TON of GME shares and WE GOT IN BEFORE THEM!! I will continue adding on dips, dollar cost averaging, and accumulating shares. I have no doubt that future hype will come and additional shareholder interest will develop because the future of Gamestop is looking BRIGHTER THAN EVER!!!\"}, {\"views\": null, \"score\": 36, \"num_comments\": 34, \"created\": 1612579806.0, \"title\": \"$GME remains #1... The \\u201cN\\u201d is falling off \\u201cBANG\\u201d... $CRSR is up from #18 to #7 going into the weekend on wsb.\", \"body\": \"\"}, {\"views\": null, \"score\": 9, \"num_comments\": 8, \"created\": 1612579729.0, \"title\": \"SLAM. Let the boys be boys. Steroid aficionado and Jenny from the block want in on the SPAC market.\", \"body\": \"This SPAC market is so jacked up right now A-Rod is  issuing a new blank check company that is looking to raise $575 million to merge with a sports/media or wellness company. This market is so fucked. Add to this the fact they got God damn Ja Rule on CNBC talking about stocks during this whole GME debacle. We are truly in unchartered waters right now. Tread carefully. Up those cash positions.\"}, {\"views\": null, \"score\": 39, \"num_comments\": 15, \"created\": 1612579653.0, \"title\": \"DONT SELL HAVE DIAMOND HANDS $GME \\ud83d\\udc8e\\ud83d\\ude4f\\ud83e\\udd8d\", \"body\": \"Seriously guys! I just invested my college funds into GME!!! Can\\u2019t wait to pay off me mums medical bills. Love you fucking retards! LETS GO TO THE MOON!!!!!\"}, {\"views\": null, \"score\": 22, \"num_comments\": 14, \"created\": 1612579287.0, \"title\": \"From +25k to -26k to +4k above my break even (you can guess what happened there...) just to hold on to GME and AMC.\", \"body\": \"\"}, {\"views\": null, \"score\": 32, \"num_comments\": 39, \"created\": 1612579179.0, \"title\": \"Fuck it I\\u2019m just gonna sell...\", \"body\": \"All my fucking belongings to buy more $GME!!\\nI\\u2019m an absolute retard, but I\\u2019ll finally be with my own people when we make it to fucking Pluto!!!\\n\\n\\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\\n\\nEdit: I\\u2019m responsible for my own investments. I don\\u2019t want advice from shills and paper handed bitches! Thanks!\\n\\nEdit 2: for my fellow degenerates that truly are concerned, no I\\u2019m not selling all my belongings, and I\\u2019m not risking my entire future. This post was originally meant to troll non believers as well as boost the morale of my fellow HOLDERS! \\nGameStop has a very close place in my heart as I lurked the racks and demo consoles regularly as a child and teenager.\\n\\nEdit 3: Last one!\\nHODLing strong 18 @ ~$270\\n*FOMO will be the end of me*\\n\\nApes strong together!\\nCan\\u2019t stop, won\\u2019t stop, mother fucking GameStop.\"}, {\"views\": null, \"score\": 24, \"num_comments\": 11, \"created\": 1612579041.0, \"title\": \"GME is Still Worth Holding Even if there isn\\u2019t Another Squeeze.\", \"body\": \"After all that\\u2019s been said and done, you\\u2019re just apart of me I can\\u2019t let go. TLDR at bottom. \\n\\nRegarding GME, worst case scenario is that the shorts report on the 9th and it all goes tits up. Whatever, maybe we don\\u2019t get 10k a share. Doesn\\u2019t change the fact that it was a solid play. The rules got turned off on us and no one saw that coming. Crazy volatility ensues. That\\u2019s why silver went up btw. Because people thought the market was insolvent and wanted to stack precious medal just in case the market exploded - there is money to be made off the panic, but I digress. Let\\u2019s say we missed the ship, This doesn\\u2019t change the fact that if you\\u2019re in now, there\\u2019s still reason to hold  GME. \\n\\nThe GME stock craze was like an adult tickle me Elmo phenomenon. America loves this shit, and we need a national feel good narrative now more than ever. The story alone  is worth enough to have two movies already in production about it. A corporate underdog movie of this magnitude has never been done before. It\\u2019s gonna make GameStop iconic. \\nGameStop HAS to survive now. It\\u2019s too marketable to lose. \\nIt\\u2019s not out of the question for GME to have a comparable value to let\\u2019s say,  TTWO which is a $200 stock in the video game industry. Depending on how they capitalize on their new situation. I\\u2019d have to imagine that GameStop has a few new options available now. \\nGameStop could pivot to streaming or some shit and change the face of Videogaming into the future. \\nThey could build an E-sports stadium or build a  team that will be worth what the Yankees are worth in 2031. \\n\\nI\\u2019m just saying, video games are only getting bigger and are at the forefront of technology and GameStop is an important Institution. \\nI don\\u2019t think America wants to see another Blockbuster situation. I just like the stock I guess. \\n\\nThis is obviously stupid and it\\u2019s important to know I\\u2019m not a financial advisor. I\\u2019m just a silly little stink that loves pudding. \\n\\nTLDR: GME could capitalize off of national sentiment and organically earn a $400 a share value.... eventually.\"}, {\"views\": null, \"score\": 27, \"num_comments\": 22, \"created\": 1612578970.0, \"title\": \"Chamath supported GME and WSB, and now his $CLOV is being shorted.\", \"body\": \"Chamath is one of the biggest supporter of GME, which leads to the stock price from below 100 to 150 before Musk joined. And because of this, he is being attacked by short company and they are shorting his $CLOV.\"}, {\"views\": null, \"score\": 3, \"num_comments\": 22, \"created\": 1612578927.0, \"title\": \"Would like to discuss two investments not called GME or AMC... But rather-\", \"body\": \"CCIV, & VGAC \\n$CCIV is rumored to merge with the likes of Lucid motors to complete with Tesla by producing 400,000 EV Cars this year\\n$VG is an interesting blank check company that's merging with 23&me \\nPretty new to this, but trying to research, and not buy hype.. So has anyone else seen this in news or anything else interesting that's not a meme stonk\"}, {\"views\": null, \"score\": 12, \"num_comments\": 23, \"created\": 1612578794.0, \"title\": \"Should I buy GME now? Is the dip over?\", \"body\": \"\"}, {\"views\": null, \"score\": 15, \"num_comments\": 22, \"created\": 1612578679.0, \"title\": \"Do we need more hype for this too work?\", \"body\": \"How do we get back the hype to GME? I feel that after the major manipulation that we saw for the past few days it has pushed away many apes from the community. We need to get GME trending in social media to bring more attention back to this.\"}, {\"views\": null, \"score\": 293, \"num_comments\": 50, \"created\": 1612578634.0, \"title\": \"This subreddit has never been a stock-pumping subreddit\", \"body\": \"If you\\u2019re depending on others to invest with you in order to gain a profit, then you just might not be investing in the right things.\\n\\nThe stock market isn\\u2019t a team sport, and there are other things to talk about rather than nonstop $GME and $AMC pushing.\\n\\nIt seems that the entire identity of WSB has been consumed by a get-rich-quick mentality.\"}, {\"views\": null, \"score\": 17, \"num_comments\": 29, \"created\": 1612578474.0, \"title\": \"$AMC and $GME tight correlation is not proof of manipulation\", \"body\": \"You clowns are looking at correlation charts of GME and AMC like it's blatant market manipulation.  They are tightly correlated because the same fucking apes are buying both. Holy shit this sub is full on fucking inbreds at this point\"}, {\"views\": null, \"score\": 876, \"num_comments\": 27, \"created\": 1612578384.0, \"title\": \"Put it all in gme\", \"body\": \"\"}, {\"views\": null, \"score\": 13, \"num_comments\": 14, \"created\": 1612578368.0, \"title\": \"Last semester in college and it was gonna be the first time I wasn\\u2019t going to have to work full time.\", \"body\": \"Welp. First shift is tomorrow. Thanks GME\"}, {\"views\": null, \"score\": 3, \"num_comments\": 13, \"created\": 1612578279.0, \"title\": \"How Can We Trust the Report on Tuesday?\", \"body\": \"I\\u2019m just a retard with 43 GME shares @ 160; I don\\u2019t know why, with all the other manipulation that we\\u2019ve witnessed, we can trust the report that comes out on Tuesday as true?\"}, {\"views\": null, \"score\": 102, \"num_comments\": 55, \"created\": 1612578274.0, \"title\": \"There is no way the normal mods are back.\", \"body\": \"This sub is a fucking disaster. The amount of posts about holding gme and amc is out of control. We get it, you're holding, we don't need 500 posts a day about it.  Am I the only one that sees this sub has been completely derailed? \\n\\nHonestly starting to consider that the HF are in here and they are now longing GME and just trying to build the hype back up with 5000 of the same fucking post. Mods never would have allowed this chaos a month ago. \\n\\nCan any mods chime in on the state of affairs in here?\"}, {\"views\": null, \"score\": 16, \"num_comments\": 21, \"created\": 1612577874.0, \"title\": \"The \\\"This is a long term hold\\\" for me people that bought in at 100+\", \"body\": \"What am I missing exactly? Amazon and Netflix are up 500% over the last 5 years. A 500% increase for GME would roughly put it around $160 (if we're generous and take the price 5 years ago at 27 and not its low of 4).\\n\\nYou are expecting GME to perform as well or better than Amazon and Netflix the past 5 years in the next 5 years? Am I simplifying this too much or are you guys just extremely delusional? I most certainly don't know shit so educate me.\"}, {\"views\": null, \"score\": 0, \"num_comments\": 13, \"created\": 1612577872.0, \"title\": \"The problem with billboards.\", \"body\": \"I keep seeing posts of people buying up billboard space. I don't get it. 99% of the people who see it will have no idea what the balls Diamond Hands, To The Moon, or even $GME means. I just feel like it is a waste of money. Unless you are buying in Times Square, put your money elsewhere.\"}, {\"views\": null, \"score\": 13, \"num_comments\": 11, \"created\": 1612577845.0, \"title\": \"Late to the party, but prepared to hold\", \"body\": \"It's taken me 2 weeks to digest this opportunity, sign up to a brokerage, deposit money and buy 3 shares in GME because i am what doctors describe as, mentally retarded. But like you, I will not let my disability get in the way of sound, unverified advise on the internet. Diamond hands till $10,000 or i'm eating moon dust in my bran flakes!!!\"}, {\"views\": null, \"score\": 0, \"num_comments\": 9, \"created\": 1612577690.0, \"title\": \"CLOV is the New GME Change my mind! Hindenburg, a large hedge fund releases a \\\"scathing report\\\" only to find out its unsubstantiated and they have puts.\\ud83e\\udd21\\ud83e\\udd21\\ud83e\\udd21 Now, Webullers and Redditors are gathering together for the next take down. Screw these hedgefunds, CLOV to the moon!\\ud83d\\ude80\\ud83d\\ude80\\ud83d\\ude80\", \"body\": \"\"}, {\"views\": null, \"score\": 2, \"num_comments\": 23, \"created\": 1612577672.0, \"title\": \"Question about selling out stock in Canada.\", \"body\": \"I am just starting to adventure into the stock game after all this GME hype. I did a little research and in Canada if you make any profit when you sell a stock you have to pay %50 of it to your government. This seems like a scam as if you lose money there is little you can do. What ways can I sell a stock and avoid paying such high penalties?\"}, {\"views\": null, \"score\": 17, \"num_comments\": 24, \"created\": 1612577582.0, \"title\": \"$GME HUGE REVERSAL here's why.\", \"body\": \"***as you can clearly see where price is heading here and it's priced at $45.50.***\\n\\n# white line is prior price where price broke resistance and broke out, price is going to retest and see if the demand is strong enough to buy back.\\n\\n**IF PRICE breaks the price line at $45.50** GAME stop is over and has been taken over by **Bears.**\\n\\nhttps://preview.redd.it/jh35sy0kmrf61.png?width=1816&format=png&auto=webp&s=9995724f49f62935213e72c35153c4b27cfa0530\\n\\n[RSI PRICE ACTION.](https://preview.redd.it/5qlyo67imrf61.png?width=1830&format=png&auto=webp&s=c2ba6d66d97d6060c3abb04a29dc84284627d9d9)\\n\\n**RSI 1HR PRICE ACTION SHOWS PRICE RETESTING RESISTANCE**\\n\\nIF THE RSI CAN BREAK THROUGH AND STAY ABOVE ON THE 1 HOUR IT IS SAFE TO SAY A BREAK OUT IS INCOMING.\"}, {\"views\": null, \"score\": 19, \"num_comments\": 21, \"created\": 1612577505.0, \"title\": \"WHY GME AND AMC WILL MAKE IT TO PLUTO IN THE NEXT FEW MONTHS\", \"body\": \"Okay, guys, this may get really technical and I know that's the last thing you wanna see, I will use a lot of big words but I honestly think it's worth it to get through this post if you have an hour or two.\\n\\n&#x200B;\\n\\n&#x200B;\\n\\nSo if you look at the volume traded over the last few days you'll notice a trend,\\n\\n&#x200B;\\n\\n&#x200B;\\n\\nSTONKS ONLY GO UP. BRRRRRRRRR\"}, {\"views\": null, \"score\": 16, \"num_comments\": 17, \"created\": 1612577454.0, \"title\": \"Why Short Interest (SI) could be the same on 2/9\", \"body\": \"For people who are hanging a lot on the upcoming SI report on 2/9, this is just something you may want to consider. I replied to someone with this comment but have found that I\\u2019ve been copy/pasting it a lot because a lot of you guys seem confused about shorts and short interest. So if that\\u2019s you, here goes: \\n\\n\\u201cI\\u2019ll paint with a broad brush here but imagine that a year ago the hedge funds borrowed the equivalent of 50% of GMEs float to short when it was at 20/shr. (For illustration purposes let\\u2019s say that\\u2019s 100 shares.) They then sell those shares and collect $2000, confident that when the time comes to return the borrowed shares, GME will be 2/shr, allowing them to buy the 100 shares for $200, return them and pocket the 1800 profit they made originally. \\n\\nBut disaster strikes! A bunch of dumb Redditors band together and invest en masse, driving the stock price up to 100/shr. Meaning that on due date, the HF now needs to shell out $10,000 to cover, putting them at an 8k loss. \\n\\nBut it gets worse. Because these Redditors are MAD. Like, slinging poop at the walls mad. And so the stock looks primed to keep rising like crazy in the near future. What do you do?\\n\\nWell, if you\\u2019re a multi-million dollar HF manager, you devise a dastardly yet overall smart plan: cut your losses and cover your short position at a loss. So you go in and buy like crazy, giving you a substantial loss. But for every short you close, you immediately open a new one to take its place at the current market price, which let\\u2019s say is now 200/shr. Now, you\\u2019re very confident that these Redditors will eventually go away and the stock will fall back to its position last year at 20/shr. \\n\\nAnd now you\\u2019re in a position where you\\u2019re not pocketing the profit from the stock falling from 20/shr to 2/shr, you can pocket the profits from it falling from 200/shr to 20/shr. Much better position for you and despite the fact that the short interest is still the same, your position is safe because for the \\u201csqueeze\\u201d to happen, stock would have to be run alllllll the way back up to above 200/shr. \\n\\nIn short, money printer go brrrrrrrrrrrrrr for the hedgies, as fucking always.\\u201d\\n\\nTL;DR - SI may very be the same in the 2/9 report but their positions will be very different.\"}, {\"views\": null, \"score\": 42, \"num_comments\": 23, \"created\": 1612577327.0, \"title\": \"Put yourself in their ( HF) shoes! You would do ANYTHING (and I mean) ANYTHING to keep this from happening!\", \"body\": \"If I were them, I'd try EVERYTHING in the book to keep you from cashing out. That is why they are BILLIONAIRES! They DO NOT get to be THAT fucking rich without shedding blood, cutting throats and being scandalous! PERIOD! For all you \\\"new-to-trading\\\" apes.......THIS DOES NOT HAPPEN OVERNIGHT! I know TONS of you lost momentum b/c you thought it would be a \\\"millionaire-over-night\\\" scenario. WE WERE WARNED THAT THIS WEEK WOULD BE ROUGH!!!!!! WE WERE WARNED THAT THE ATTACKS WOULD HAPPEN! You paper handed asshats that sold can suck it! WE OWN THE STOCK! It isn't \\\"down\\\" if you do NOT sell! Man damn...It has been put so plainly so many times. DO NOT SELL!!!! When/IF...it goes up to $400 (possibly 7-800+) next week, or the week after...DO...........NOT..........SELL! Don't be happy with breaking even! WE CAN LITERALLY TAKE IT TO THE MOON!!!!!!!!!!!! HOLD!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Yes, I know TOO many people are already burnt out on this GME stock (only been a week LMFAO) but you have to HOLD for longer if you want the desired end result. Plain and simple! Like I said in another comment: Relax...Chill the fuck out....QUIT WATCHING YOUR SCREEN 24/7....and relax! Even if these HF fucks are violating every security and breaking every rule.....wait for it! BUY MORE AT THE DIP, IF you can afford it! RELAX. It has only been a week! We were told about this TOO many times! TO THE MOON!  \\n\\n\\nObligatory: Not a pro. Do NOT listen to me b/c I eat non-food items. Monkeys, flying aircraft, body parts, precious gems, POS mentally ill degenerate worthless fuckwad.   \\n\\n\\nJust fucking HOLD!\"}]"